---
kind: property
id: P:Autodesk.Revit.DB.Visual.BumpMap.TextureScaleLock
source: html/5cff2a01-bac3-e53f-6c98-2dabc281fe6a.htm
---
# Autodesk.Revit.DB.Visual.BumpMap.TextureScaleLock Property

The property labeled "Scale Lock" from the "BumpMap" schema.

## Syntax (C#)
```csharp
public static string TextureScaleLock { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".